# CLI packages
brew "awscli"
brew "bitwarden-cli"
brew "ca-certificates"
brew "composer"
brew "git"
brew "git-lfs"
brew "gh"
brew "gmp"
brew "gnupg"
brew "node"
brew "n"
brew "openssl"
brew "pnpm"
brew "starship"
brew "vim"
brew "watch"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks (apps)
# cask "bitwarden" DO NOT USE: this is not compatible with browser extension
cask "busycal"
cask "chatgpt"
cask "cleanmymac"
cask "daisydisk"
cask "docker-desktop"
cask "font-fira-code-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-symbols-only-nerd-font"
cask "github"
cask "google-chrome"
cask "handbrake"
# cask "iterm2"
cask "insta360-link-controller"
cask "java"
cask "jetbrains-toolbox"
cask "microsoft-office"
cask "obs"
cask "postman"
cask "raycast"
cask "rstudio"
cask "sourcetree"
cask "subler"
# cask "sublime-text" Installs sublime-text 4
cask "surfshark"
cask "textsniper"
# cask "unclutter"
cask "visual-studio-code"
cask "vlc"
cask "yed"
cask "zoomus"
